config.org
#+STARTUP: indent 
#+TITLE: Doug Horst's emacs configuration
#+OPTIONS: H:5 num:nil tags:nil toc:nil timestamps:t
#+LAYOUT: post
#+DESCRIPTION: Loading emacs configuration using org-babel
#+TAGS: emacs
#+CATEGORIES: editing
* Introduction
This is my current emacs loader file through babel.  I have borrowed heavily
from Dennis Ogbe, Arjen Wiersma and Sacha Chua
* Doug's custom functions
** These helper functions allow restarting  after making changes
*** DONE figure out the key bindings for my custom functions
#+BEGIN_SRC emacs-lisp :tangle yes
(defun reload-config ()
    (interactive)
    (org-babel-load-file "~/.emacs.d/config.org"))
  (defun config ()
    (interactive)
    (find-file "~/.emacs.d/config.org"))
  (global-set-key (kbd "C-c r c") 'reload-config)
  (global-set-key (kbd "C-c o c") 'config)
#+END_SRC
** Kill whole word from anyplace in the word
#+BEGIN_SRC emacs-lisp :tangle yes
  (defun dch-kill-whole-word ()
    (interactive)
    (backward-word)
    (kill-word 1))
  (global-set-key (kbd "C-c k w") 'dch-kill-whole-word)
#+END_SRC
** Kill current buffer
#+BEGIN_SRC emacs-lisp :tangle yes
  (defun dch-kill-curr-buffer ()
    (interactive)
    (kill-buffer (current-buffer)))
  (global-set-key (kbd "C-x k") 'dch-kill-curr-buffer)
#+END_SRC
** Kill all buffers
#+BEGIN_SRC emacs-lisp :tangle yes
  (defun dch-kill-all-buffers ()
    (interactive)
    (mapc 'kill-buffer (buffer-list)))
  (global-set-key (kbd "C-M-s-k") 'dch-kill-all-buffers)
#+END_SRC
** copy (non-destructive) whole line
#+BEGIN_SRC emacs-lisp :tangle yes
  (defun dch-copy-whole-line ()
    (interactive)
    (save-excursion
      (kill-new
       (buffer-substring
        (point-at-bol)
        (point-at-eol)))))
  (global-set-key (kbd "C-c w l") 'dch-copy-whole-line)
#+END_SRC
* Set up the basic user info
We'll start with just full name and contact info.

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; Set user name and contact info

  (setq user-full-name "Doug Horst"
        user-mail-address "dchorst@gmail.com"
        user-login-name "dchorst")
#+END_SRC
* Setup the basic user interface elements
** Turn off the annoying bell.
In version 25+ the bell function was turned on by default and doesn't seem to
have a silent option.  Just kill the function.

#+BEGIN_SRC emacs-lisp :tangle yes

(setq ring-bell-function 'ignore)
(setq auto-revert-verbose nil)

#+END_SRC
** Get more editing space without a lot of visual cruft.
Turn off the tool bar and the scroll bar.  Leave the menu bar in.  I don't
remember the all the actions/options for various modes and I can get a refresher
from the menus.
*** TODO Figure out how to make the menu bar work in terminal mode.
#+BEGIN_SRC emacs-lisp :tangle yes

;; ui elements

(tool-bar-mode -1)
(scroll-bar-mode -1)
;;(menu-bar-mode -1)

;; mode line settings
(line-number-mode t)
(column-number-mode t)
(size-indication-mode t)

#+END_SRC
** Set up for smooth scrolling rather than the jumping
#+BEGIN_SRC emacs-lisp :tangle yes

(setq scroll-margin 0
      scroll-conservatively 100000
      scroll-preserve-screen-position 1)

#+END_SRC

** Set up the start up options, initial layout and frame geography.
#+BEGIN_SRC emacs-lisp :tangle yes

(setq-default fill-column 80)
(setq inhibit-startup-message t)
(setq inhibit-splash-screen t)

;;; Opening geometry

(add-to-list 'default-frame-alist '(height . 60))
(add-to-list 'default-frame-alist '(width . 235))
;;; Minimal fringe
(fringe-mode '(4 . 4))

#+END_SRC
** Start with two windows and dired home directory in the left window -INACTIVE
I've been back and forth on this.  As I get more comfortable with working dired
into my workflow I think I want this in.
I am going to try dashboard for the startup for a while.  We'll see which works better.
#+BEGIN_SRC emacs-lisp :tangle no

(when window-system (split-window-right))
(setq initial-buffer-choice "~/")

#+END_SRC
** Let's try dashboard for configuring the startup
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package dashboard
    :ensure t
    :config
    (dashboard-setup-startup-hook)
    (setq dashboard-items ' ((recents . 10)))
    (setq dashboard-banner-logo-title "Welcome Back"))
#+END_SRC
** Make sure utf-8 is the default character set.
#+BEGIN_SRC emacs-lisp :tangle yes

(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)

#+END_SRC

** Cursor setup
I want a solid (non-blinking) cursor and highlight the line we are currently working on.
#+BEGIN_SRC emacs-lisp :tangle yes

(blink-cursor-mode -1)
(setq blink-cursor-blinks 0)
(when window-system (global-hl-line-mode t))
(make-variable-buffer-local 'global-hl-line-mode)

#+END_SRC
** I'd also like to use beacon mode to highlight the cursor location when I switch buffers.
#+BEGIN_SRC emacs-lisp :tangle yes
    (use-package beacon
      :ensure t
      :init
      (beacon-mode 1)
      (setq beacon-push-mark 35)
      (setq beacon-color "#666600"))
#+END_SRC

** Setup basic workflow preferences
#+BEGIN_SRC emacs-lisp :tangle yes

;; Newline at end of file
(setq require-final-newline t)

;; Use 'y' or 'n' instead of 'yes' or 'no'
(fset 'yes-or-no-p 'y-or-n-p)

;; delete the selection with a keypress
(delete-selection-mode t)

#+END_SRC
*** Use which key for helping with what key to press next.
#+BEGIN_SRC emacs-lisp :tangle yes
(use-package which-key
  :ensure t
  :config
  (which-key-mode))
#+END_SRC
** Spaces and tabs
*** Spaces instead of tabs
Tabs are evil! I want spaces instead of tabs, and want exactly 3
spaces instead of a tab. Note to self: Apparently emacs is smart
enough to not do this in Python mode, which is a good thing.

#+BEGIN_SRC emacs-lisp :tangle yes

  ;; Natural reading, wrap at the word
  (setq-default word-wrap 1)

  (setq-default indent-tabs-mode nil)
  (setq-default tab-width 3)
  (setq-default tab-stop-list (number-sequence 3 120 3))
  (setq c-basic-indent 3)
  (setq sh-basic-offset 3)
#+END_SRC

*** Agressive indent mode for lisps
#+BEGIN_SRC emacs-lisp :tangle yes

  (use-package aggressive-indent
     :ensure t
     :config
         (add-hook 'emacs-lisp-mode-hook #'aggressive-indent-mode)
         (add-hook 'clojure-mode-hook #'aggressive-indent-mode)
         (add-hook 'lisp-mode-hook #'aggressive-indent-mode)
  )
#+END_SRC

** Use rainbow package to show colors.
Every time emacs encounters a hexadecimal code that resembles a color, it will
automatically highlight it in the appropriate color.
#+BEGIN_SRC emacs-lisp :tangle yes
(use-package rainbow-mode
  :ensure t
  :init
    (add-hook 'prog-mode-hook 'rainbow-mode))
#+END_SRC
** Org Bullets
Let's use the org bullets package to make the bullets a little prettier.
#+BEGIN_SRC emacs-lisp :tangle yes
(use-package org-bullets
  :ensure t
  :config
    (add-hook 'org-mode-hook (lambda () (org-bullets-mode))))
#+END_SRC
** Pretty symbols
Changes lambda and a few others to display the actual symbols in GUI version only.
#+BEGIN_SRC emacs-lisp :tangle yes
(when window-system
      (use-package pretty-mode
      :ensure t
      :config
      (global-pretty-mode t)))
#+END_SRC
* Let's set up the themes and font faces
** Theme
I used the Solarized themes until changing to Pop!_OS.  With the Pop!_OS themes
Solarized didn't blend well.  There is an emacs theme for Pop!_OS in progress
but it is not there yet so I settled on Darktooth.  It is close but with better
contrast. I will work at getting that Pop!_OS theme as I like it which is why I
add the custom themes directory.
*** TODO Adjust the Pop!_OS emacs theme to my preferences

#+BEGIN_SRC emacs-lisp :tangle yes

  (add-to-list 'custom-theme-load-path "~/.emacs.d/themes/")

  (use-package darktooth-theme
     :ensure t
     :config
       (load-theme 'darktooth 'no-confirm))

#+END_SRC
** Font faces
I like Adobe's Source Code Pro for the text body and inconsolata for the frame faces.
#+BEGIN_SRC emacs-lisp :tangle yes

(set-face-attribute 'default nil :family "Source Code Pro" :height 120 )
(set-frame-font  "inconsolata" nil t)
(set-face-attribute 'fringe nil :background "#2d2d2d")
(set-face-attribute 'font-lock-comment-face nil :slant 'italic)
(set-face-attribute 'font-lock-comment-face nil :weight 'semibold)
(set-fontset-font "fontset-default" 'unicode "DejaVu Sans Mono for Powerline")

#+END_SRC
** Use symbols where appropriate
#+BEGIN_SRC emacs-lisp :tangle yes
(when window-system (global-prettify-symbols-mode t))
#+END_SRC
* Backup system - replace the standard backup system with one of our own.
We will do a version control system.  We will store up to 64 versions of the
file in a sub-directory, .bak oif the current pwd.
#+BEGIN_SRC emacs-lisp :tangle yes
(setq version-control t        ;; OpenVMS-esque
      backup-by-copying t      ;; Copy-on-write-esque
      kept-new-versions 64     ;; Indeliable-ink-esque
      kept-old-versions 0      ;; 
      delete-old-versions nil  ;; 
      )
(setq backup-directory-alist   ;; Save backups in $(pwd)/.bak
      '(("." . ".bak"))        ;;
      )

; Disable auto-saving
(setq auto-save-default nil)

#+END_SRC

* dired
Dennis Ogbe has some extensive customization of dired that I will try for a while
** General Settings
The first two lines of this tell dired to stop asking me whether I
want to recursively delete or copy, since I never respond to that
question with "No".

The last line enables "Do What I Mean" mode for dired: If I'm in a
split frame with two dired buffers, the default target to copy (and
rename) will be the other window.
#+BEGIN_SRC emacs-lisp :tangle yes
(setq dired-recursive-copies 'always)
(setq dired-recursive-deleted 'always)
(setq dired-dwim-target t)
(setq dired-listing-switches "-alh")

#+END_SRC
** Automatically revert dired buffers
I also want to automatically revert buffers, but to be quiet about it.
The first line actually enables auto-revert for any buffers.  I also
added <F5> as a key to manually revert.
#+BEGIN_SRC emacs-lisp :tangle yes

(global-auto-revert-mode t)
(setq global-auto-revert-non-file-buffers t)
(setq auto-revert-verbose nil)
(global-set-key (kbd "<f5>") 'revert-buffer)

#+END_SRC
** Less verbosity
We can show file details with the ( and ) keys.
#+BEGIN_SRC emacs-lisp :tangle yes

(use-package dired-details
   :ensure t
   :config
   (setq dired-details-hidden-string "")
)

#+END_SRC
