config.el
(defun reload-config ()
    (interactive)
    (org-babel-load-file "~/.emacs.d/config.org"))
  (defun config ()
    (interactive)
    (find-file "~/.emacs.d/config.org"))
  (global-set-key (kbd "C-c r c") 'reload-config)
  (global-set-key (kbd "C-c o c") 'config)

(defun dch-kill-whole-word ()
  (interactive)
  (backward-word)
  (kill-word 1))
(global-set-key (kbd "C-c k w") 'dch-kill-whole-word)

(defun dch-kill-curr-buffer ()
  (interactive)
  (kill-buffer (current-buffer)))
(global-set-key (kbd "C-x k") 'dch-kill-curr-buffer)

(defun dch-kill-all-buffers ()
  (interactive)
  (mapc 'kill-buffer (buffer-list)))
(global-set-key (kbd "C-M-s-k") 'dch-kill-all-buffers)

(defun dch-copy-whole-line ()
  (interactive)
  (save-excursion
    (kill-new
     (buffer-substring
      (point-at-bol)
      (point-at-eol)))))
(global-set-key (kbd "C-c w l") 'dch-copy-whole-line)

;; Set user name and contact info

(setq user-full-name "Doug Horst"
      user-mail-address "dchorst@gmail.com"
      user-login-name "dchorst")

(setq ring-bell-function 'ignore)
(setq auto-revert-verbose nil)

;; ui elements

(tool-bar-mode -1)
(scroll-bar-mode -1)
;;(menu-bar-mode -1)

;; mode line settings
(line-number-mode t)
(column-number-mode t)
(size-indication-mode t)

(setq scroll-margin 0
      scroll-conservatively 100000
      scroll-preserve-screen-position 1)

(setq-default fill-column 80)
(setq inhibit-startup-message t)
(setq inhibit-splash-screen t)

;;; Opening geometry

(add-to-list 'default-frame-alist '(height . 60))
(add-to-list 'default-frame-alist '(width . 235))
;;; Minimal fringe
(fringe-mode '(4 . 4))

(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook)
  (setq dashboard-items ' ((recents . 10)))
  (setq dashboard-banner-logo-title "Welcome Back"))

(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)

(blink-cursor-mode -1)
(setq blink-cursor-blinks 0)
(when window-system (global-hl-line-mode t))
(make-variable-buffer-local 'global-hl-line-mode)

(use-package beacon
  :ensure t
  :init
  (beacon-mode 1)
  (setq beacon-push-mark 35)
  (setq beacon-color "#666600"))

;; Newline at end of file
(setq require-final-newline t)

;; Use 'y' or 'n' instead of 'yes' or 'no'
(fset 'yes-or-no-p 'y-or-n-p)

;; delete the selection with a keypress
(delete-selection-mode t)

(use-package which-key
  :ensure t
  :config
  (which-key-mode))

;; Natural reading, wrap at the word
(setq-default word-wrap 1)

(setq-default indent-tabs-mode nil)
(setq-default tab-width 3)
(setq-default tab-stop-list (number-sequence 3 120 3))
(setq c-basic-indent 3)
(setq sh-basic-offset 3)

(use-package aggressive-indent
   :ensure t
   :config
       (add-hook 'emacs-lisp-mode-hook #'aggressive-indent-mode)
       (add-hook 'clojure-mode-hook #'aggressive-indent-mode)
       (add-hook 'lisp-mode-hook #'aggressive-indent-mode)
)

(use-package rainbow-mode
  :ensure t
  :init
    (add-hook 'prog-mode-hook 'rainbow-mode))

(use-package org-bullets
  :ensure t
  :config
    (add-hook 'org-mode-hook (lambda () (org-bullets-mode))))

(when window-system
      (use-package pretty-mode
      :ensure t
      :config
      (global-pretty-mode t)))

(add-to-list 'custom-theme-load-path "~/.emacs.d/themes/")

(use-package darktooth-theme
   :ensure t
   :config
     (load-theme 'darktooth 'no-confirm))

(set-face-attribute 'default nil :family "Source Code Pro" :height 120 )
(set-frame-font  "inconsolata" nil t)
(set-face-attribute 'fringe nil :background "#2d2d2d")
(set-face-attribute 'font-lock-comment-face nil :slant 'italic)
(set-face-attribute 'font-lock-comment-face nil :weight 'semibold)
(set-fontset-font "fontset-default" 'unicode "DejaVu Sans Mono for Powerline")

(when window-system (global-prettify-symbols-mode t))

(setq version-control t        ;; OpenVMS-esque
      backup-by-copying t      ;; Copy-on-write-esque
      kept-new-versions 64     ;; Indeliable-ink-esque
      kept-old-versions 0      ;; 
      delete-old-versions nil  ;; 
      )
(setq backup-directory-alist   ;; Save backups in $(pwd)/.bak
      '(("." . ".bak"))        ;;
      )

; Disable auto-saving
(setq auto-save-default nil)

(setq dired-recursive-copies 'always)
(setq dired-recursive-deleted 'always)
(setq dired-dwim-target t)
(setq dired-listing-switches "-alh")

(global-auto-revert-mode t)
(setq global-auto-revert-non-file-buffers t)
(setq auto-revert-verbose nil)
(global-set-key (kbd "<f5>") 'revert-buffer)

(use-package dired-details
   :ensure t
   :config
   (setq dired-details-hidden-string "")
)

(require 'linum)
