config.org
** Opening files
This is mostly stolen from here. Uses nohup to spawn child processes
without annoying new buffers. First, we define a list of default
programs.

#+BEGIN_SRC emacs-lisp :tangle no

  (use-package dired-x
    :ensure nil)
  (use-package dired-aux
    :ensure nil)

  (setq dired-guess-shell-alist-user
        '(("\\.pdf\\'" "evince")
          ("\\.\\(?:djvu\\|eps\\)\\'" "zathura")
          ("\\.\\(?:jpg\\|jpeg\\|png\\|gif\\|xpm\\)\\'" "eog")
          ("\\.\\(?:xcf\\)\\'" "gimp")
          ("\\.\\(?:csv\\|odt\\|ods\\)\\'" "libreoffice")
          ("\\.\\(?:mp4\\|mp3\\|mkv\\|avi\\|flv\\|ogv\\)\\(?:\\.part\\)?\\'"
           "vlc")
          ("\\.html?\\'" "firefox")))
#+END_SRC

Now define a new function to start a process in the background.

#+BEGIN_SRC emacs-lisp :tangle no

  (defvar dired-filelist-cmd
    '(("vlc" "-L")))

  (defun dired-start-process (cmd &optional file-list)
    (interactive
     (let ((files (dired-get-marked-files
                   t current-prefix-arg)))
       (list
        (dired-read-shell-command "Open with: "
                                  current-prefix-arg files)
        files)))
    (let (list-switch)
      (start-process
       cmd nil shell-file-name
       shell-command-switch
       (format
        "nohup 1>/dev/null 2>/dev/null %s \"%s\""
        (if (and (> (length file-list) 1)
                 (setq list-switch
                       (cadr (assoc cmd dired-filelist-cmd))))
            (format "%s %s" cmd list-switch)
          cmd)
        (mapconcat #'expand-file-name file-list "\" \"")))))
#+END_SRC
At last, we remap two standard keys: We want !, which defaults to
dired-do-shell-command, to run the old dired-do-aync-shell-command and
use it for things like a quick unzip or unrar x or something like
that. The old & shall be remapped to dired-start-process.

#+BEGIN_SRC emacs-lisp :tangle no

  (define-key dired-mode-map "!" 'dired-do-async-shell-command)
  (define-key dired-mode-map "&" 'dired-start-process)
#+END_SRC
* Mode line
Let's set up the mode line so it is readable.
** First, line number formatting
#+BEGIN_SRC emacs-lisp :tangle yes

(require 'linum)
(set-face-attribute 'linum nil
                    :background (face-attribute 'default :background)
                    :foreground (face-attribute 'font-lock-comment-face :foreground))
(defface linum-current-line-face
  `((t :background "gray30" :foreground "black"))
  "Face for the currently active Line number")
(defvar my-linum-current-line-number 0)
(defun get-linum-format-string ()
  (setq-local my-linum-format-string
              (let ((w (length (number-to-string
                                (count-lines (point-min) (point-max))))))
                (concat " %" (number-to-string w) "d "))))
(add-hook 'linum-before-numbering-hook 'get-linum-format-string)
(defun my-linum-format (line-number)
  (propertize (format my-linum-format-string line-number) 'face
              (if (eq line-number my-linum-current-line-number)
                  'linum-current-line-face
                'linum)))
(setq linum-format 'my-linum-format)
(defadvice linum-update (around my-linum-update)
  (let ((my-linum-current-line-number (line-number-at-pos)))
    ad-do-it))
(ad-activate 'linum-update)

#+END_SRC
Toggle line numbers (num) or relative line numbers (rnum) in a safe
manner by turning the other off in case it is on.

#+BEGIN_SRC emacs-lisp :tangle yes
(defun num ()
  (interactive)
  (if (bound-and-true-p relative-line-numbers-mode)
      (relative-line-numbers-mode 'toggle))
  (linum-mode 'toggle))
(defun rnum ()
  (interactive)
  (if (bound-and-true-p linum-mode)
      (linum-mode 'toggle))
  (relative-line-numbers-mode 'toggle))
#+END_SRC
** Let's use a nice graphical modification to the mode line
Use the cool powerline setup for the mode line

#+BEGIN_SRC emacs-lisp :tangle yes
  (column-number-mode 1)
  (use-package powerline
    :ensure t
    :config
       (powerline-center-theme)
  )
  ;; compact mode-line
  (use-package smart-mode-line
    :ensure t
    :defer t)
   ;; hey where is my clock ?
    (setq display-time-format " %H:%M %b %d %a ")
    (display-time-mode 1)
#+END_SRC
* Window management with ace-window.
This will add a large window indicator when there are more than 2 windows
showing and let me type in the window indicator to go to that window, I still
must start the sequence with C-X O to start it.  I originally discovered this
from both Mike Zamansky and Sachua.
#+BEGIN_SRC emacs-lisp :tangle yes
 (use-package ace-window
    :ensure t
    :init
    (progn
      (setq aw-scope 'frame)
      (global-set-key (kbd "C-x O") 'other-frame)
      (global-set-key [remap other-window] 'ace-window)
      (custom-set-faces
       '(aw-leading-char-face
         ((t (:inherit ace-jump-face-foreground :height 3.0)))))
      ))
#+END_SRC
* Parentheses
** Show parens
This mode highlights the matching parenthesis on point.

#+BEGIN_SRC emacs-lisp :tangle yes

  (show-paren-mode 1)
  (setq show-paren-delay 0)
#+END_SRC

** Rainbow delimiters for LISP based languages
But for lisp like languages, I want to witness the full power of
colorful rainbow-delimiters! I will even set them to pastel versions
of the rainbow colors stolen from this wallpaper.

#+BEGIN_SRC emacs-lisp :tangle yes

  (use-package rainbow-delimiters
     :ensure t
     :config
       (set-face-attribute 'rainbow-delimiters-depth-1-face nil
                           :foreground "#78c5d6")
       (set-face-attribute 'rainbow-delimiters-depth-2-face nil
                           :foreground "#bf62a6")
       (set-face-attribute 'rainbow-delimiters-depth-3-face nil
                           :foreground "#459ba8")
       (set-face-attribute 'rainbow-delimiters-depth-4-face nil
                           :foreground "#e868a2")
       (set-face-attribute 'rainbow-delimiters-depth-5-face nil
                           :foreground "#79c267")
       (set-face-attribute 'rainbow-delimiters-depth-6-face nil
                           :foreground "#f28c33")
       (set-face-attribute 'rainbow-delimiters-depth-7-face nil
                           :foreground "#c5d647")
       (set-face-attribute 'rainbow-delimiters-depth-8-face nil
                           :foreground "#f5d63d")
       (set-face-attribute 'rainbow-delimiters-depth-9-face nil
                           :foreground "#78c5d6")
  )

  (set-face-attribute 'rainbow-delimiters-unmatched-face nil
                      :foreground 'unspecified
                      :inherit 'show-paren-mismatch
                      :strike-through t)
#+END_SRC

Set up for the modes for rainbow delimiters will be used

#+BEGIN_SRC emacs-lisp :tangle yes

  (add-hook 'emacs-lisp-mode-hook 'rainbow-delimiters-mode)
  (add-hook 'lisp-mode-hook 'rainbow-delimiters-mode)
  (add-hook 'text-mode-hook 'rainbow-delimiters-mode)
  (add-hook 'prog-mode-hook 'rainbow-delimiters-mode)
#+END_SRC

** Paredit
This setup is largely based on the defaults and [[https://gitlab.com/buildfunthings/emacs-config][Arjen Wiersma]] setup for clojure.

#+BEGIN_SRC emacs-lisp :tangle yes

    ;; Paredit

    (use-package paredit
      :ensure t
      :config
      (autoload 'enable-paredit-mode "paredit" "Turn on pseudo-structural editing of Lisp code." t)
      (add-hook 'emacs-lisp-mode-hook       #'enable-paredit-mode)
      (add-hook 'clojure-mode-hook          #'enable-paredit-mode)
      (add-hook 'eval-expression-minibuffer-setup-hook #'enable-paredit-mode)
      (add-hook 'ielm-mode-hook             #'enable-paredit-mode)
      (add-hook 'lisp-mode-hook             #'enable-paredit-mode)
      (add-hook 'lisp-interaction-mode-hook #'enable-paredit-mode)
      (add-hook 'pythonn-mode-hook          #'enable-paredit-mode)
      )
    ;; useful global keybindings from Endless Parentheses Blogpost 28-June-2016

    (global-set-key (kbd "C-M-u") #'paredit-backward-up)
    (global-set-key (kbd "C-M-n") #'paredit-forward-up)
    ;; This one's surpisingly useful for writing prose.
    (global-set-key "\M-S" #'paredit-splice-sexp-killing-backward)
    (global-set-key "\M-R" #'paredit-raise-sexp)
    (global-set-key "\M-(" #'paredit-wrap-round)
    (global-set-key "\M-[" #'paredit-wrap-square)
    (global-set-key "\M-{" #'paredit-wrap-curly)

    ;; fix the paredit binding of M-q and set it back to fill-paragraph
    (when (fboundp 'paredit-mode-map)
       (eval-after-load 'paredit
           (define-key paredit-mode-map (kbd "M-q") nil)))
    (global-set-key (kbd "M-q") 'fill-paragraph)

#+END_SRC

One final thing for paredit.  Let's see if we can use it in the minibuffer as well.

#+BEGIN_SRC emacs-lisp :tangle yes

  (add-hook 'eval-expression-minibuffer-setup-hook #'paredit-mode)
#+END_SRC
* Handling the buffers
Again borrowing from Dennis Ogbe who also borrowed these ideas for implementing
ibuffer.
** Filter groups
#+BEGIN_SRC emacs-lisp :tangle yes
(use-package ibuffer
   :ensure t
   :config
(setq my-ibuffer-filter-group-name "my-filters"))
(setq ibuffer-saved-filter-groups
      (list (nreverse
             `(("Directories" (mode . dired-mode))
               ("Magit" (name . "^\\*magit.*$"))
               ("Org" (mode . org-mode))
               ("Shell" (or (mode . term-mode)
                            (mode . eshell-mode)
                            (mode . shell-mode)))
               ("Global" (name . "^\\*.*\\*$"))
               ("Interactive" (or (mode . inferior-python-mode)
                                  (mode . inferior-lisp-mode)
                                  (mode . inferior-scheme-mode)
                                  (mode . ielm-mode)))
               ,my-ibuffer-filter-group-name))))
#+END_SRC

Reverse the order of the filter groups. Kind of confusing: Since I'm reversing
the order of the groups above, this snippet ensures that the groups are ordered
in the way they are written above, with the "Default" group on top. This advice
might need to be ported to the new advice system soon.
#+BEGIN_SRC emacs-lisp :tangle yes

(defadvice ibuffer-generate-filter-groups
    (after reverse-ibuffer-groups () activate)
  (setq ad-return-value (nreverse ad-return-value)))

#+END_SRC
