config.el
(set-face-attribute 'linum nil
                    :background (face-attribute 'default :background)
                    :foreground (face-attribute 'font-lock-comment-face :foreground))
(defface linum-current-line-face
  `((t :background "gray30" :foreground "black"))
  "Face for the currently active Line number")
(defvar my-linum-current-line-number 0)
(defun get-linum-format-string ()
  (setq-local my-linum-format-string
              (let ((w (length (number-to-string
                                (count-lines (point-min) (point-max))))))
                (concat " %" (number-to-string w) "d "))))
(add-hook 'linum-before-numbering-hook 'get-linum-format-string)
(defun my-linum-format (line-number)
  (propertize (format my-linum-format-string line-number) 'face
              (if (eq line-number my-linum-current-line-number)
                  'linum-current-line-face
                'linum)))
(setq linum-format 'my-linum-format)
(defadvice linum-update (around my-linum-update)
  (let ((my-linum-current-line-number (line-number-at-pos)))
    ad-do-it))
(ad-activate 'linum-update)

(defun num ()
  (interactive)
  (if (bound-and-true-p relative-line-numbers-mode)
      (relative-line-numbers-mode 'toggle))
  (linum-mode 'toggle))
(defun rnum ()
  (interactive)
  (if (bound-and-true-p linum-mode)
      (linum-mode 'toggle))
  (relative-line-numbers-mode 'toggle))

(column-number-mode 1)
(use-package powerline
  :ensure t
  :config
     (powerline-center-theme)
)
;; compact mode-line
(use-package smart-mode-line
  :ensure t
  :defer t)
 ;; hey where is my clock ?
  (setq display-time-format " %H:%M %b %d %a ")
  (display-time-mode 1)

(use-package ace-window
   :ensure t
   :init
   (progn
     (setq aw-scope 'frame)
     (global-set-key (kbd "C-x O") 'other-frame)
     (global-set-key [remap other-window] 'ace-window)
     (custom-set-faces
      '(aw-leading-char-face
        ((t (:inherit ace-jump-face-foreground :height 3.0)))))
     ))

(show-paren-mode 1)
(setq show-paren-delay 0)

(use-package rainbow-delimiters
   :ensure t
   :config
     (set-face-attribute 'rainbow-delimiters-depth-1-face nil
                         :foreground "#78c5d6")
     (set-face-attribute 'rainbow-delimiters-depth-2-face nil
                         :foreground "#bf62a6")
     (set-face-attribute 'rainbow-delimiters-depth-3-face nil
                         :foreground "#459ba8")
     (set-face-attribute 'rainbow-delimiters-depth-4-face nil
                         :foreground "#e868a2")
     (set-face-attribute 'rainbow-delimiters-depth-5-face nil
                         :foreground "#79c267")
     (set-face-attribute 'rainbow-delimiters-depth-6-face nil
                         :foreground "#f28c33")
     (set-face-attribute 'rainbow-delimiters-depth-7-face nil
                         :foreground "#c5d647")
     (set-face-attribute 'rainbow-delimiters-depth-8-face nil
                         :foreground "#f5d63d")
     (set-face-attribute 'rainbow-delimiters-depth-9-face nil
                         :foreground "#78c5d6")
)

(set-face-attribute 'rainbow-delimiters-unmatched-face nil
                    :foreground 'unspecified
                    :inherit 'show-paren-mismatch
                    :strike-through t)

(add-hook 'emacs-lisp-mode-hook 'rainbow-delimiters-mode)
(add-hook 'lisp-mode-hook 'rainbow-delimiters-mode)
(add-hook 'text-mode-hook 'rainbow-delimiters-mode)
(add-hook 'prog-mode-hook 'rainbow-delimiters-mode)

;; Paredit

(use-package paredit
  :ensure t
  :config
  (autoload 'enable-paredit-mode "paredit" "Turn on pseudo-structural editing of Lisp code." t)
  (add-hook 'emacs-lisp-mode-hook       #'enable-paredit-mode)
  (add-hook 'clojure-mode-hook          #'enable-paredit-mode)
  (add-hook 'eval-expression-minibuffer-setup-hook #'enable-paredit-mode)
  (add-hook 'ielm-mode-hook             #'enable-paredit-mode)
  (add-hook 'lisp-mode-hook             #'enable-paredit-mode)
  (add-hook 'lisp-interaction-mode-hook #'enable-paredit-mode)
  (add-hook 'pythonn-mode-hook          #'enable-paredit-mode)
  )
;; useful global keybindings from Endless Parentheses Blogpost 28-June-2016

(global-set-key (kbd "C-M-u") #'paredit-backward-up)
(global-set-key (kbd "C-M-n") #'paredit-forward-up)
;; This one's surpisingly useful for writing prose.
(global-set-key "\M-S" #'paredit-splice-sexp-killing-backward)
(global-set-key "\M-R" #'paredit-raise-sexp)
(global-set-key "\M-(" #'paredit-wrap-round)
(global-set-key "\M-[" #'paredit-wrap-square)
(global-set-key "\M-{" #'paredit-wrap-curly)

;; fix the paredit binding of M-q and set it back to fill-paragraph
(when (fboundp 'paredit-mode-map)
   (eval-after-load 'paredit
       (define-key paredit-mode-map (kbd "M-q") nil)))
(global-set-key (kbd "M-q") 'fill-paragraph)

(add-hook 'eval-expression-minibuffer-setup-hook #'paredit-mode)

(use-package ibuffer
   :ensure t
   :config
(setq my-ibuffer-filter-group-name "my-filters"))
(setq ibuffer-saved-filter-groups
      (list (nreverse
             `(("Directories" (mode . dired-mode))
               ("Magit" (name . "^\\*magit.*$"))
               ("Org" (mode . org-mode))
               ("Shell" (or (mode . term-mode)
                            (mode . eshell-mode)
                            (mode . shell-mode)))
               ("Global" (name . "^\\*.*\\*$"))
               ("Interactive" (or (mode . inferior-python-mode)
                                  (mode . inferior-lisp-mode)
                                  (mode . inferior-scheme-mode)
                                  (mode . ielm-mode)))
               ,my-ibuffer-filter-group-name))))

(defadvice ibuffer-generate-filter-groups
    (after reverse-ibuffer-groups () activate)
  (setq ad-return-value (nreverse ad-return-value)))
