config.org
** Other settings

Only show groups that have active buffers

#+BEGIN_SRC emacs-lisp :tangle yes

  (setq ibuffer-show-empty-filter-groups nil)
#+END_SRC
Dont show the summary or headline.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq ibuffer-display-summary nil)
#+END_SRC

Display more characters in the buffer name column, also convert sizes to a human
readable format. [[http://www.emacswiki.org/emacs/IbuffferMode][Stolen from the wiki.]]

#+BEGIN_SRC emacs-lisp :tangle yes

  ;; Use human readable Size column instead of original one
  (define-ibuffer-column size-h
    (:name "Size" :inline t)
    (cond
     ((> (buffer-size) 1000000) (format "%7.1fM" (/ (buffer-size) 1000000.0)))
     ((> (buffer-size) 100000) (format "%7.0fk" (/ (buffer-size) 1000.0)))
     ((> (buffer-size) 1000) (format "%7.1fk" (/ (buffer-size) 1000.0)))
     (t (format "%8d" (buffer-size)))))

  ;; Modify the default ibuffer-formats
  (setq ibuffer-formats
        '((mark modified read-only " "
                (name 40 60 :left :elide)
                " "
                (size-h 9 -1 :right)
                " "
                (mode 16 16 :left :elide)
                " "
                filename-and-process)))
#+END_SRC

** Buffers
Automagically keep buffer list up to date, enable filter groups defined above,
disable trailing whitespace

#+BEGIN_SRC emacs-lisp :tangle yes

  (defun my-ibuffer-hooks ()
    (ibuffer-auto-mode 1)
    (ibuffer-switch-to-saved-filter-groups my-ibuffer-filter-group-name)
    (no-trailing-whitespace))
  (add-hook 'ibuffer-mode-hook 'my-ibuffer-hooks)
#+END_SRC

** Alias/keybinding - enable instead of list buffers

#+BEGIN_SRC emacs-lisp :tangle yes
  (defalias 'list-buffers 'ibuffer)
  (global-set-key (kbd "C-x C-b") 'ibuffer)
#+END_SRC

This is a long line to see if we fixed the key binding for the fill-paragraph
command. And some more text to test it.

* Terminal
We'll try Dennis Ogbe's ansi terminal setup for a while.  We'll also set up
better shell as an alternate.
** Setup the choice of the shell to use
This will disable the query of which shell to run.  We'll start with fish.
#+BEGIN_SRC emacs-lisp :tangle yes
(defvar my-term-shell "/usr/bin/bash")
(defadvice ansi-term (before force-bash)
  (interactive (list my-term-shell)))
(ad-activate 'ansi-term)
#+END_SRC
** Close on exit
#+BEGIN_SRC emacs-lisp :tangle yes
(defadvice term-sentinel (around my-advice-term-sentinel (proc msg))
  (if (memq (process-status proc) '(signal exit))
      (let ((buffer (process-buffer proc)))
        ad-do-it
        (kill-buffer buffer))
    ad-do-it))
(ad-activate 'term-sentinel)
#+END_SRC
** Mode toggle
We can either be in char mode, which is more like a traditional terminal
emulator, or in line mode, which is more akin to the M-x shell behaviour.
Toggle with C-x C-j.
#+BEGIN_SRC emacs-lisp :tangle yes
(defun term-toggle-mode ()
  (interactive)
  (if (term-in-line-mode)
      (term-char-mode)
    (term-line-mode)))
#+END_SRC
** Terminal Hooks
#+BEGIN_SRC emacs-lisp :tangle yes
(defun my-term-hook ()
  (goto-address-mode)
  (local-set-key "\C-c\C-j" 'term-toggle-mode) ;; toggle line/char mode
  (local-set-key "\C-c\C-k" 'term-toggle-mode)
  (setq global-hl-line-mode nil)
  (setq term-buffer-maximum-size 10000)
  (setq-local ml-interactive? t) ;; for mode line
  (setq-local show-dir-in-mode-line? t) ;; also mode linec'
  (setq show-trailing-whitespace nil)
  ;; disable company in favor of shell completion
  (company-mode -1))
(add-hook 'term-mode-hook 'my-term-hook)
#+END_SRC
** Alias
Run the terminal by doing M-x sh
#+BEGIN_SRC emacs-lisp :tangle yes
(defalias 'sh 'ansi-term)
#+END_SRC
** Better Shell
The default and recommended bindings seem to work OK.
#+BEGIN_SRC emacs-lisp :tangle yes
(use-package better-shell
    :ensure t
    :bind (("C-'" . better-shell-shell)
           ("C-;" . better-shell-remote-open)))
#+END_SRC
* Swiper, counsel and ivy
Swiper gives us a really efficient incremental search with regular expressions
and Ivy / Counsel replace a lot of ido or helms completion functionality
#+BEGIN_SRC emacs-lisp :tangle yes

(use-package counsel
  :ensure t
  :bind
  (("M-x" . counsel-M-x)
   ("M-y" . counsel-yank-pop)
   :map ivy-minibuffer-map
   ("M-y" . ivy-next-line))
)

(use-package ivy
  :ensure t
  :diminish (ivy-mode)
  :bind (("C-x b" . ivy-switch-buffer))
  :config
  (ivy-mode 1)
  (setq ivy-use-virtual-buffers t)
  (setq ivy-display-style 'fancy)
  (setq ivy-count-format "%d/%d ")
)

(use-package swiper
  :ensure t
  :diminish ivy-mode
  :bind (("C-s" . swiper)
         ("C-c C-r" . ivy-resume)
         ("M-x" . counsel-M-x)
         ("C-x C-f" . counsel-find-file)
         ("C-M-i" . complete-symbol)
         ("C-." . counsel-imenu)
         ("C-c 8" . counsel-unicode-char)
         ("C-c v" . ivy-push-view)
         ("C-c V" . ivy-pop-view)
         ("M-y" . counsel-yank-pop))
  )

#+END_SRC
* Miscellaneous Packages to aid workflow
** Company mode
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package company
    :ensure t
    :init
    (add-hook 'after-init-hook 'global-company-mode))
#+END_SRC
** Flycheck
[[https://github.com/flycheck/flycheck][Flycheck]] works out of the box so there is no real configuration or customization
to do.
#+BEGIN_SRC emacs-lisp :tangle yes
(use-package flycheck
   :ensure t
   :init
     (global-flycheck-mode t)
)
#+END_SRC
** PDF Tools
PDFTools lets me annotate/markup pdf files, search with in pdf documents and a
bunch of other cool stuff.  I want to try and make it work for my research
projects.
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package pdf-tools
    :ensure t
    :config
    (pdf-tools-install)
    )

  (use-package org-pdfview
    :ensure t)
#+END_SRC
** Popup Kill Ring
/I am using counsel-yank-pop right now.  I'll decide later on this./
Give a popup menu for pasting from the kill ring and bind it to M-y
#+BEGIN_SRC emacs-lisp :tangle no
  (use-package popup-kill-ring
    :ensure t
    :bind ("M-y" . popup-kill-ring))

#+END_SRC
** Hungry delete - delete all white space when you delete one
Since I am using Paredit it redefines the functions hungry delete uses so I need
to set backward-delete-char-untabify-method to all to get the backspace portion
of this working.  I haven't figured out how to get the forward delete enabled yet.
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package hungry-delete
    :ensure t
    :config (global-hungry-delete-mode)
            (setq backward-delete-char-untabify-method 'all))
#+END_SRC
** Getting word definitions
I will try define-word from Melpa written by abo-abo.
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package define-word
    :ensure t
    :bind (("C-c d" . define-word-at-point)
           ("C-c D" . define-word))
    )
#+END_SRC
** Multiple cursors
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package multiple-cursors
    :ensure t
    )
  (global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)

  (global-set-key (kbd "C->") 'mc/mark-next-like-this)
  (global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
  (global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this)
#+END_SRC
* Org Mode
I'll gradually build this up from different places as I get more proficient with
all things org.
** set up my org structure templates
#+BEGIN_SRC emacs-lisp :tangle yes
  (add-to-list 'org-structure-template-alist
               '("el" "#+BEGIN_SRC emacs-lisp :tangle yes\n?\n#+END_SRC"))
#+END_SRC

** org-ac

This is a extension of Emacs that provide auto-complete sources for org-mode.
This allows us to use auto-complete as substitute for pcomplete which is bound to M-TAB.

#+BEGIN_SRC emacs-lisp :tangle no 

(use-package org-ac
    :ensure t
    :init (progn
      (require 'org-ac)
      (org-ac/config-default)
     ))

#+END_SRC

** Org Default directories

#+BEGIN_SRC emacs-lisp :tangle yes

      (custom-set-variables
        '(org-directory "~/Dropbox/orgfiles")
        '(org-default-notes-file (concat org-directory "/notes.org"))
        '(org-export-html-postamble nil)
        '(org-hide-leading-stars t)
        '(org-startup-folded (quote overview))
        '(org-startup-indented t)
          )

      (setq org-agenda-files (list "~/Dropbox/orgfiles/gcal.org"
                                   "~/Dropbox/orgfiles/life.org"
                                   "~/Dropbox/orgfiles/work.org"
                                   "~/Dropbox/orgfiles/tech.org"
                                   "~/Dropbox/orgfiles/write.org"
                                   "~/Dropbox/orgfiles/theo.org")
      )

#+END_SRC

