config.el

(global-set-key "\C-cc" 'org-capture)
(global-set-key "\C-ca" 'org-agenda)
(global-set-key "\C-cl" 'org-store-link)
(global-set-key "\C-cb" 'org-switchb)

(setq org-capture-templates
   '(
     ("b" "Book Project")
     ("bs" "Scene" entry
      (file+headline "~/Dropbox/orgfiles/book-projects/scenes.org" "Scenes")
      (file "~/Dropbox/orgfiles/org-templates/tpl-book-scene.txt")
      :prepend t :empty-lines-before 1)
     ("bb" "Bio" entry
      (file+headline "~/Dropbox/orgfiles/book-projects/bios.org" "Biographies")
      (file "~/Dropbox/orgfiles/org-templates/tpl-book-bio.txt")
      :prepend t :empty-lines-before 1)
     ("bi" "Idea" entry
      (file+headline "~/Dropbox/orgfiles/book-projects/book-ideas.org" "Ideas")
      (file "~/Dropbox/orgfiles/org-templates/tpl-book-idea.txt")
      :prepend t :empty-lines-before 1)
     ("r" "Research Notes")
     ("rt" "Text Note" entry
      (file+headline "~/Dropbox/orgfiles/notes.org" "Notes")
      (file "~/Dropbox/orgfiles/org-templates/tpl-text-note.txt")
      :prepend t :empty-lines-before 1)
     ("rl" "Link Note" entry
      (file+headline "~/Dropbox/orgfiles/links.org" "Links")
      (file "~/Dropbox/orgfiles/org-templates/tpl-link-note.txt")
      :prepend t :empty-lines-before 1)
     )
)

(defadvice org-capture-finalize 
   (after delete-capture-frame activate)  
    "Advise capture-finalize to close the frame"  
   (if (equal "capture" (frame-parameter nil 'name))  
       (delete-frame)))

(defadvice org-capture-destroy 
   (after delete-capture-frame activate)  
    "Advise capture-destroy to close the frame"  
   (if (equal "capture" (frame-parameter nil 'name))  
       (delete-frame)))  

(use-package noflet
   :ensure t )
     (defun make-capture-frame ()
      "Create a new frame and run org-capture."
      (interactive)
      (make-frame '((name . "capture")))
      (select-frame-by-name "capture")
      (delete-other-windows)
      (noflet ((switch-to-buffer-other-window (buf) (switch-to-buffer buf)))
        (org-capture))
)

(setq
 org-src-fontify-natively t
 org-src-tab-acts-natively t)

(setq org-latex-listings 'minted)

(setq org-latex-pdf-process (list "latexmk -f -pdf %f"))

(setq org-file-apps '((auto-mode . emacs)
                      ("\\.x?html?\\'" . "firefox %s")
                      ("\\.pdf\\'" . "evince \"%s\"")
                      ("\\.pdf::\\([0-9]+\\)\\'" . "evince \"%s\" -p %1")
                      ("\\.pdf.xoj" . "xournal %s")))

(setq org-file-apps '((auto-mode . emacs)
                      ("\\.x?html?\\'" . "firefox %s")
                      ("\\.pdf\\'" . "evince \"%s\"")
                      ("\\.pdf::\\([0-9]+\\)\\'" . "evince \"%s\" -p %1")
                      ("\\.pdf.xoj" . "xournal %s")))

;; Set up Environment for Clojure
;; First CIDER
(use-package cider
  :ensure t)
